Feature: Прогноз погоди

  Scenario: Перевірка отримання погоди для введеного міста
    Given користувач знаходиться на головній сторінці
    When він вводить назву міста "Київ"
    Then він бачить інформацію про погоду для "Kyiv"

  Scenario: Додавання міста до улюблених
    Given користувач знаходиться на сторінці улюблених міст
    When він додає місто "Львів" до улюблених
    Then місто "Львів" відображається у списку улюблених

  Scenario: Видалення міста з улюблених
    Given місто "Суми" є у списку улюблених
    When користувач видаляє місто "Суми" з улюблених
    Then місто "Суми" більше не відображається у списку улюблених
